# vsoWidgetSetBound

## Description
```pascal
PROCEDURE vsoWidgetSetBound(
				widgetID_Popup  : LONGINT;
				widgetID_Offset : LONGINT;
				boundID         : LONGINT;
				isTop           : BOOLEAN;
				offsetLegPrm    : STRING);
```

```python

def vs.vsoWidgetSetBound(widgetID_Popup, widgetID_Offset, boundID, isTop, offsetLegPrm):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|widgetID_Popup|LONGINT||
|widgetID_Offset|LONGINT||
|boundID|LONGINT||
|isTop|BOOLEAN||
|offsetLegPrm|STRING||

## Version
Availability: from Vectorworks 2012
## Category
* Object Events